events/API Call Events/issue.getInfo/APIResponse - issue.getInfo.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:s2="http://www.alert-project.eu/APIcall-request" xmlns:s3="http://www.alert-project.eu/APIcall-response" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>METADATASERVICE</ns1:sender>
							<ns1:timestamp>10000</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10020</ns1:endTime>
								<!-- name of event -->
								<ns1:eventName>ALERT.Metadata.APICallResponse</ns1:eventName>
								<ns1:eventId>9856</ns1:eventId>
								<ns1:eventType>reply</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<ns1:apiResponse>
									<!-- name of method -->
									<s3:apiCall>issue.getInfo</s3:apiCall>
									<s3:responseData>
										<!-- list (or any other structure) of results -->
										<s3:issue>
											<!-- issue id -->
											<s3:issueId>184671</s3:issueId>
											<!-- id of issue author person -->
											<s3:issueAuthor>
												<s3:name>Sander Pientka</s3:name>
												<s3:id>cumulus0007@gmail.com</s3:id>
												<s3:email>cumulus0007@gmail.com</s3:email>
											</s3:issueAuthor>
											<!-- issue status (Assigned, Open, Verified, Resolved, Closed) -->
											<s3:issueStatus></s3:issueStatus>
											<!-- issue resolution (Duplicate, Fixed, Invalid, ThirdParty, WontFix, WorksForMe, Later, Remind) -->
											<s3:issueResolution></s3:issueResolution>
											<s3:issueDescription>Notify user on hardware changes</s3:issueDescription>
											<s3:issueKeyword></s3:issueKeyword>
											<s3:issueProduct>
												<!-- id of issue project -->
												<s3:productId>solid</s3:productId>
												<!-- id of project component -->
												<s3:productComponentId>general</s3:productComponentId>
												<!-- project version -->
												<s3:productVersion>unspecified</s3:productVersion>
											</s3:issueProduct>
											<s3:issueComputerSystem>
												<!-- id of computer system -->
												<s3:computerSystemId></s3:computerSystemId>
												<!-- computer system platform -->
												<s3:computerSystemPlatform>Ubuntu Packages</s3:computerSystemPlatform>
												<!-- computer system OS -->
												<s3:computerSystemOS>Linux</s3:computerSystemOS>
											</s3:issueComputerSystem>
											<!-- issue priority (1 - 5) -->
											<s3:issuePriority></s3:issuePriority>
											<!-- issue severity (Blocker, Critical, Major, Minor, Trivial, Feature) -->
											<s3:issueSeverity></s3:issueSeverity>
											<!-- id of issue assigned person -->
											<s3:issueAssignedTo>
												<s3:name>Alex Fiestas</s3:name>
												<s3:id>afiestas@kde.org</s3:id>
												<s3:email>afiestas@kde.org</s3:email>
											</s3:issueAssignedTo>
											<!-- ids of issue CC persons -->
											<s3:issueCCPerson>
												<s3:name></s3:name>
												<s3:id>angel_blue_co2004@yahoo.com</s3:id>
												<s3:email>angel_blue_co2004@yahoo.com</s3:email>
											</s3:issueCCPerson>
											<!-- issue URL from bugzilla -->
											<s3:issueUrl>https3://bugs.kde.org/show_bug.cgi?id=184671</s3:issueUrl>
											<!-- ids of related issues -->
											<s3:issueDependsOnId></s3:issueDependsOnId>
											<s3:issueBlocksId></s3:issueBlocksId>
											<s3:issueDuplicateOfId></s3:issueDuplicateOfId>
											<s3:issueMergedIntoId></s3:issueMergedIntoId>
											<!-- date time in format yyyy-MM-dd HH:mm -->
											<s3:issueDateOpened>2009-02-17 16:31</s3:issueDateOpened>
											<s3:issueLastModified>2011-04-15 10:55:57</s3:issueLastModified>
											<s3:issueMilestone>
												<!-- id of milestone -->
												<s3:milestoneId></s3:milestoneId>
												<s3:milestoneTarget></s3:milestoneTarget>
											</s3:issueMilestone>
											<!-- issue comments -->
											<s3:issueComment>
												<s3:commentId></s3:commentId>
												<s3:commentNumber>0</s3:commentNumber>
												<s3:commentText>Version: (using KDE 4.2.0) Os3: Linux Installed from: Ubuntu Packages It would be awesome if KDE notifies te user of newly installed hardware, missing drivers, programs to use the connected device, etc.</s3:commentText>
												<s3:commentPerson>
													<s3:name>Sander Pientka</s3:name>
													<s3:id>cumulus0007@gmail.com</s3:id>
													<s3:email>cumulus0007@gmail.com</s3:email>
												</s3:commentPerson>
												<s3:commentDate>2009-02-17 16:31:37</s3:commentDate>
											</s3:issueComment>
											<s3:issueComment>
												<s3:commentId></s3:commentId>
												<s3:commentNumber>1</s3:commentNumber>
												<s3:commentText>If a driver is missing, clicking on the notification should open the package manager (by default) so the user can find a driver</s3:commentText>
												<s3:commentPerson>
													<s3:name>Angel Blue01</s3:name>
													<s3:id>angel_blue_co2004@yahoo.com</s3:id>
													<s3:email>angel_blue_co2004@yahoo.com</s3:email>
												</s3:commentPerson>
												<s3:commentDate>2009-03-04 18:11:19</s3:commentDate>
											</s3:issueComment>
											<!-- issue attachments -->
											<s3:issueAttachment>
												<s3:attachmentId></s3:attachmentId>
												<s3:attachmentFilename></s3:attachmentFilename>
												<s3:attachmentType></s3:attachmentType>
												<s3:attachmentCreator>
													<s3:name></s3:name>
													<s3:id></s3:id>
													<s3:email></s3:email>
												</s3:attachmentCreator>
											</s3:issueAttachment>
											<!-- issue activities -->
											<s3:issueActivity>
												<s3:activityId></s3:activityId>
												<s3:activityWho>angel_blue_co2004@yahoo.com</s3:activityWho>
												<s3:activityWhen>2009-03-04 18:11:19</s3:activityWhen>
												<s3:activityWRA>
													<s3:activityWhat>Priority</s3:activityWhat>
													<s3:activityRemoved>medium</s3:activityRemoved>
													<s3:activityAdded>highest</s3:activityAdded>
												</s3:activityWRA>
												<s3:activityWRA>
													<s3:activityWhat>CC</s3:activityWhat>
													<s3:activityRemoved>lcanas@libresoft.es</s3:activityRemoved>
													<s3:activityAdded></s3:activityAdded>
												</s3:activityWRA>
												<s3:activityWRA>
													<s3:activityWhat>Severity</s3:activityWhat>
													<s3:activityRemoved>normal</s3:activityRemoved>
													<s3:activityAdded>blocker</s3:activityAdded>
												</s3:activityWRA>
											</s3:issueActivity>
											<s3:issueActivity>
												<s3:activityId></s3:activityId>
												<s3:activityWho>ervin@kde.org</s3:activityWho>
												<s3:activityWhen>2011-04-15 10:55:57</s3:activityWhen>
												<s3:activityWRA>
													<s3:activityWhat>AssignedTo</s3:activityWhat>
													<s3:activityRemoved>ervin@kde.org</s3:activityRemoved>
													<s3:activityAdded>afiestas@kde.org</s3:activityAdded>
												</s3:activityWRA>
											</s3:issueActivity>
											<!-- issue issue tracker -->
											<s3:issueTracker>
												<s3:issueTrackerId></s3:issueTrackerId>
												<s3:issueTrackerType>bugzilla</s3:issueTrackerType>
												<s3:issueTrackerURL>https://bugs.kde.org/</s:issueTrackerURL>
											</s3:issueTracker>
										</s3:issue>
									</s3:responseData>
								</ns1:apiResponse>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>